
## Plan Result




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.database.azurerm_postgresql_active_directory_administrator.admin
  * module.database.azurerm_postgresql_database.postgres-db
  * module.database.azurerm_postgresql_server.postgres-paas
  * module.database.azurerm_private_endpoint.postgres[0]
  * module.database.azurerm_resource_group.data-resourcegroup
  * module.database.null_resource.set-user-permissions[0]
  * module.database.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.database.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "darts-api-data-staging"
      + server_name         = "darts-api-staging"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.database.azurerm_postgresql_database.postgres-db will be created
  + resource "azurerm_postgresql_database" "postgres-db" {
      + charset             = "utf8"
      + collation           = "en-GB"
      + id                  = (known after apply)
      + name                = "api"
      + resource_group_name = "darts-api-data-staging"
      + server_name         = "darts-api-staging"
    }

  # module.database.azurerm_postgresql_server.postgres-paas will be created
  + resource "azurerm_postgresql_server" "postgres-paas" {
      + administrator_login              = "api_user"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 35
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "darts-api-staging"
      + public_network_access_enabled    = false
      + resource_group_name              = "darts-api-data-staging"
      + sku_name                         = "GP_Gen5_8"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "BuiltFrom"           = "https://github.com/HMCTS/darts-api.git"
          + "application"         = "darts"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
      + version                          = "11"
    }

  # module.database.azurerm_private_endpoint.postgres[0] will be created
  + resource "azurerm_private_endpoint" "postgres" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "darts-staging-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "darts-api-data-staging"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/darts-api.git"
          + "application"         = "darts"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "postgres-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "darts-staging-db"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.database.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "darts-api-data-staging"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/darts-api.git"
          + "application"         = "darts"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }
    }

  # module.database.null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "darts-api"
          + "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        }
    }

  # module.database.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Vars":{}} -->